RIET/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>crmGeoMarket</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmBusinessSegment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ) Тип цен по умолчанию для офрмления покупок по данному договору</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетАгентскогоНДС</name>
    <comment>Признак того что в данном договоре организация выступает в качестве налогового агента</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <comment>Разновидность договора с обязанностью оплаты организацией НДС в качестве налогового агента </comment>
    <type>
      <types>EnumRef.ВидыАгентскихДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетыВУсловныхЕдиницах</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SiebelID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SiebelName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <comment>ermPtDaysTo</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEng</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКНазванию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>EnumRef.СпособыРасчетаКомиссионногоВознаграждения</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоКурсуММВБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонтракта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторВидовЭкономическойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>PIC_ID</name>
    <comment>(rgs) Sharepoint ID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяChecklist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ermContractID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermSourceID</name>
    <comment>ID источника создания контракта</comment>
    <type>
      <types>CatalogRef.ermSourcesIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>crmContractID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmCreatedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmCreatedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmEffectiveDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermTrigger</name>
    <type>
      <types>CatalogRef.ermTriggerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>crmExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractCurrency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractValueUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmContractName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>crmDFNName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermPtDaysFrom</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermНеИспользоватьPtDaysTo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermPtType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermCustomerID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermDocumentFlowPeriodFrom</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermDocumentFlowPeriodTo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ermAmendment</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ermAmendmentName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КодыCRMпоСегментам</name>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>crmContractID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PIC_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ, Сообщать = Истина) Экспорт

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоНовый() и не ПометкаУдаления=Ссылка.ПометкаУдаления тогда
		//В случае установки или снятия пометки удаления не производть проверкую
		Возврат;
	КонецЕсли;

	// Проверим можно ли изменять реквизиты договора.
	// Проверка осуществляется только если записывается уже существующий договор
	Если НЕ ЭтоНовый() Тогда

		Если ЭтоГруппа Тогда

			// Для группы владельца менять нельзя
			Если Владелец <> Ссылка.Владелец Тогда

				Если не Сообщать=Ложь тогда
					Сообщить("Нельзя изменять контрагента для группы договоров.", СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
			КонецЕсли; 

		Иначе

			// Проверим Заполнение обязательных реквизитов "Организация"
			Если ОбщегоНазначения.ЗначениеНеЗаполнено(Организация) Тогда
				Если не Сообщать=Ложь тогда
					Сообщить("Для договора """ + Наименование + """ не указана организация.
							 |Элемент не записан.", 
							 СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
			КонецЕсли;

			// Проверим возможность смены владельца для договора
			Если Владелец <> Ссылка.Владелец Тогда

				Если КритерииОтбора.ДокументыПоДоговоруКонтрагента.Найти(Ссылка).Количество() > 0 Тогда

					Если не Сообщать=Ложь тогда
						Сообщить("Существуют документы, оформленные по договору """ + Наименование + """.
							 |Контрагент договора не может быть изменен, элемент не записан.", 
							 СтатусСообщения.Важное);
					КонецЕсли;
					Отказ = Истина;

				КонецЕсли;

			КонецЕсли;

			// Проверим возможность смены способа ведения взаиморасчетов и валюты взаиморасчетов
			Если ВедениеВзаиморасчетов <> Ссылка.ВедениеВзаиморасчетов
			 ИЛИ ВалютаВзаиморасчетов <> Ссылка.ВалютаВзаиморасчетов 
			 ИЛИ ВидДоговора <> Ссылка.ВидДоговора
			 ИЛИ Организация <> Ссылка.Организация
			 ИЛИ РасчетыВУсловныхЕдиницах <> Ссылка.РасчетыВУсловныхЕдиницах Тогда
			    МассивДокументов = КритерииОтбора.ДокументыПоДоговоруКонтрагента.Найти(Ссылка);
			    ЕстьПроведенныеДокументы = Ложь;

				Для каждого Документ из МассивДокументов Цикл

					ЕстьПроведенныеДокументы = Документ.Проведен;

					Если ЕстьПроведенныеДокументы тогда
						Прервать;
					КонецЕсли;

				КонецЦикла;

				Если ЕстьПроведенныеДокументы Тогда
                    Если не Сообщать=Ложь тогда
						Сообщить("Существуют документы, проведенные по договору """ + Наименование + """.
								 |Реквизиты ""Организация"", ""Ведение взаиморасчетов"", ""Валюта взаиморасчетов"", ""Вид договора"", ""Расчеты в условных единицах"" не могут быть изменены.
								 |Элемент не записан.", 
								 СтатусСообщения.Важное);
					КонецЕслИ;
					Отказ = Истина;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли; // Если ЭтоГруппа Тогда

	КонецЕсли; // Если НЕ ЭтоНовый() Тогда

	// Проверим заполнение обязательных реквизитов.
	Если Не ЭтоГруппа Тогда

		// Проверим Заполнение обязательных реквизитов "Организация"
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(Организация) Тогда
			Если не Сообщать=Ложь тогда
				Сообщить("Не указана организация для договора.", СтатусСообщения.Важное);
			КонецЕслИ;	
			Отказ = Истина;
		КонецЕсли; 

		// Проверим, заполнена ли валюта
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(ВалютаВзаиморасчетов) Тогда
			Если не Сообщать=Ложь тогда
				Сообщить("Не указана валюта договора ", СтатусСообщения.Важное);
			КонецЕсли;
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнен ли вид договора
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(ВидДоговора) Тогда
			Если не Сообщать=Ложь тогда
				Сообщить("Не указан вид договора ", СтатусСообщения.Важное);
			КонецЕсли;
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли;
	
	//-> RG-Soft VIvanov 2016/08/12
	Если Не Отказ Тогда
		Если Не ЗначениеЗаполнено(ermContractID) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(ДоговорыКонтрагентов.ermContractID) КАК ermContractID
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.ermContractID ПОДОБНО &Префикс
			|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка";
			Префикс = Константы.ermSourceID.Получить().Код; 
			Запрос.УстановитьПараметр("Префикс", Префикс + "[0-9]%");
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекНомерСтрокой = Выборка.ermContractID;
				Если ПустаяСтрока(ТекНомерСтрокой) Тогда
					текНомер = 1;
				Иначе
					ТекНомерСтрокой = СокрЛП(Прав(ТекНомерСтрокой, СтрДлина(ТекНомерСтрокой) - СтрДлина(Префикс)));
					Попытка
						текНомер = Число(текНомерСтрокой) + 1;
					Исключение
						текНомер = 1;
					КонецПопытки;
				КонецЕсли;
			Иначе
				текНомер = 1;
			КонецЕсли;
			ЧислоНулей = 10 - СтрДлина(Префикс) - СтрДлина(Строка(текНомер));
			ermContractID = Префикс;
			Для инд = 1 По ЧислоНулей Цикл
				ermContractID = ermContractID + "0";
			КонецЦикла;
			ermContractID = ermContractID + Строка(текНомер);
			ДубльДоговора = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("ermContractID",ermContractID);
			Если ЗначениеЗаполнено(ДубльДоговора) Тогда
				ЗаписьЖурналаРегистрации("АвтонумерацияErmContractID", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ДоговорыКонтрагентов, Ссылка, "Найден существующий договор с ERM Contract ID " + ermContractID + ".");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//<- RG-Soft VIvanov 2016/08/12

КонецПроцедуры // ПередЗаписью()

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

//-> RG-Soft VIvanov 2016/08/12
Процедура ПриКопировании(ОбъектКопирования)
	
	ermContractID = "";	
	
КонецПроцедуры
//<- RG-Soft VIvanov 2016/08/12
